In [1]:
import numpy as np
import pandas as pd

In [3]:
df= pd.read_csv('Book2.csv')
df.head()

           Numbers
0  +91 99210 01919
1  +91 80871 01066
2  +91 81416 02626
3  +91 98905 48721
4  +91 80101 98229

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3607 entries, 0 to 3606
Data columns (total 1 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Numbers  3607 non-null   object
dtypes: object(1)
memory usage: 28.3+ KB

In [5]:
# Remove "+" and spaces from the 'Text' column
df['Numbers'] = df['Numbers'].str.replace('+', '').str.replace(' ', '')

# Display the updated dataframe
df.head()

C:\Users\DELL 2\AppData\Local\Temp\ipykernel_23492\4207270042.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Numbers'] = df['Numbers'].str.replace('+', '').str.replace(' ', '')

        Numbers
0  919921001919
1  918087101066
2  918141602626
3  919890548721
4  918010198229

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3607 entries, 0 to 3606
Data columns (total 1 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Numbers  3607 non-null   object
dtypes: object(1)
memory usage: 28.3+ KB

In [7]:
df.to_csv('Book2_new.csv')

In [10]:
df1= pd.read_excel('Datainsights numbers.xlsx')
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5359 entries, 0 to 5358
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Numbers     1751 non-null   float64
 1   Unnamed: 1  3607 non-null   object
dtypes: float64(1), object(1)
memory usage: 83.9+ KB

In [11]:
df1.head()

        Numbers Unnamed: 1
0  9.177219e+11        NaN
1  9.185114e+11        NaN
2  9.194210e+11        NaN
3  9.199601e+11        NaN
4  9.199690e+11        NaN